// 1. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.WriteLine("Введите трехзначное число: ");
// string number = Console.ReadLine()!;
// if(number.Length == 3){
//     Console.WriteLine($"{number[1]}");
// }
// else{
//     Console.WriteLine("Введено неверное число");
// }




// 2. Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// Console.WriteLine("Введите число: ");
// int num = int.Parse(Console.ReadLine()!);
// int result = (num%10);
// Console.WriteLine($"{num} -> {result}");




// 3. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("Введите цифру, обозначающую день недели: ");
// int num = int.Parse(Console.ReadLine()!);

// if(num < 5 ){
//     Console.WriteLine("Рабочий день");
// }
// else{
//     Console.WriteLine("Выходной день");
// }
//  if(num > 7){
//     Console.WriteLine("Нет такого дня недели");
// }

